lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Lights/ZigbeeHaOnOffPorchLight/ZigbeeHaOnOffPorchLight.ino
  return false;
}

[[maybe_unused]] bool activeScan(ScanResult* outResult) {
  if (outResult == nullptr) {
    return false;
  }
  *outResult = ScanResult{};
  refreshCommissioningState();
  ZigbeeBeaconCandidate candidate{};
  if (!ZigbeeCommissioning::activeScan(g_radio, &g_macSequence, &g_network,
                                       &candidate) ||
      !candidate.valid) {
    return false;
  }

  outResult->valid = candidate.valid;
  outResult->channel = candidate.channel;
  outResult->rssiDbm = candidate.rssiDbm;
  outResult->score = candidate.score;
  outResult->beacon = candidate.beacon;
  return true;
}

[[maybe_unused]] bool waitForAssociationResponse(uint16_t* outAssignedShort) {
  if (outAssignedShort == nullptr) {
    return false;
  }

  const uint32_t deadline = millis() + 1500U;
  while (static_cast<int32_t>(millis() - deadline) < 0) {
    uint8_t pollFrame[127] = {0U};
    uint8_t pollLength = 0U;
    if (!ZigbeeCodec::buildDataRequest(g_macSequence++, g_panId, g_parentShort,
                                       kIeeeAddress, pollFrame, &pollLength)) {
      return false;
    }
    (void)g_radio.transmit(pollFrame, pollLength, false, 1200000UL);

    const uint32_t listenDeadline = millis() + 90U;
    while (static_cast<int32_t>(millis() - listenDeadline) < 0) {
      ZigbeeFrame frame{};
      if (!g_radio.receive(&frame, 5000U, 350000UL)) {
        continue;
      }

      ZigbeeMacAssociationResponseView response{};
      if (!ZigbeeCodec::parseAssociationResponse(frame.psdu, frame.length,
                                                 &response) ||
          !response.valid ||
          response.destinationExtended != kIeeeAddress ||
          response.panId != g_panId || response.status != 0x00U) {
        continue;
      }

      *outAssignedShort = response.assignedShort;
      return true;
    }

    delay(25);
  }

  return false;
}

bool performJoin() {
  refreshCommissioningState();
  if (!ZigbeeCommissioning::performJoin(g_radio, &g_macSequence, kIeeeAddress,
                                        currentMacCapabilityFlags(),
                                        &g_network)) {
    return false;
  }
  armInterviewGraceWindow();
  configureDeviceForCurrentNetwork();
  applyLedState();
  return persistState();
}

bool performSecureRejoin() {
  refreshCommissioningState();
  uint32_t secureRejoinFrameCounter = 0U;
  if (!g_outgoingFrameCounters.allocate(
          ZigbeeOutgoingCounterDomain::kNwk, &g_store,
          &secureRejoinFrameCounter)) {
    return false;
  }
  if (!ZigbeeCommissioning::performSecureRejoin(
          g_radio, &g_macSequence, kIeeeAddress,
          currentMacCapabilityFlags(), &g_network, secureRejoinFrameCounter)) {
    return false;
  }
  armInterviewGraceWindow();
  configureDeviceForCurrentNetwork();
  applyLedState();
  return persistState();
}

void processIncomingFrame(const ZigbeeFrame& frame) {
  const uint32_t nowMs = millis();
  ZigbeeDataFrameView macData{};
  if (!ZigbeeRadio::parseDataFrameShort(frame.psdu, frame.length, &macData) ||
      !macData.valid || macData.panId != g_panId ||
      macData.destinationShort != g_localShort) {
    return;
  }

  ZigbeeNetworkFrame nwk{};
  ZigbeeNwkSecurityHeader security{};
  uint8_t decryptedPayload[127] = {0U};
  uint8_t decryptedPayloadLength = 0U;
  bool nwkValid = false;
  // Trust Center transport-key delivery is APS-secured over an unsecured NWK
  // frame immediately after association, before the active network key exists.
  const bool requireSecuredNwk = g_haveActiveNetworkKey;
  if (g_haveActiveNetworkKey) {
    const uint64_t expectedTc = expectedTrustCenterIeee();
    nwkValid = ZigbeeSecurity::parseSecuredNwkFrame(
        macData.payload, macData.payloadLength, g_activeNetworkKey, &nwk,
        &security, decryptedPayload, &decryptedPayloadLength, expectedTc);
    if (nwkValid &&
        (!security.valid ||
         (expectedTc != 0U && security.sourceIeee != expectedTc) ||
         security.keySequence != g_activeNetworkKeySequence ||
         security.frameCounter <= g_lastInboundSecurityFrameCounter)) {
      return;
    }
  }
  if (!nwkValid && !requireSecuredNwk) {
    nwkValid =
        ZigbeeCodec::parseNwkFrame(macData.payload, macData.payloadLength, &nwk);
  }
  if (!nwkValid || !nwk.valid || nwk.destinationShort != g_localShort) {
    return;
  }
  if (security.valid) {
    g_lastInboundSecurityFrameCounter = security.frameCounter;
    if (!persistState()) {
      return;
    }
  }

  if (!security.valid) {
    const bool commissioningCommandExpected =
        !g_haveActiveNetworkKey &&
        ZigbeeCommissioning::waitingForJoinSecurityMaterial(g_network) &&
        nwk.frameType == ZigbeeNwkFrameType::kData;
    if (!commissioningCommandExpected) {
      return;
    }
    (void)handleApsCommand(nwk.payload, nwk.payloadLength, nwk.sourceShort,
                           0U, false);
    return;
  }

  if (nwk.frameType == ZigbeeNwkFrameType::kCommand) {
    ZigbeeNwkEndDeviceTimeoutResponse timeoutResponse{};
    if (ZigbeeCommissioning::acceptEndDeviceTimeoutResponse(
            g_network, nwk.payload, nwk.payloadLength, &timeoutResponse)) {
      ZigbeeCommissioning::applyEndDeviceTimeoutResponse(&g_network,
                                                         timeoutResponse);
      if (g_parentPollIntervalMs > 1000UL) {
        g_parentPollIntervalMs = 1000UL;
      }
      persistState();
      Serial.print("end_device_timeout status=0x");
      Serial.print(timeoutResponse.status, HEX);
      Serial.print(" parent_info=0x");
      Serial.print(timeoutResponse.parentInformation, HEX);
      Serial.print(" poll_ms=");
      Serial.print(g_parentPollIntervalMs);
      Serial.print("\r\n");
    }
    return;
  }

  ZigbeeApsDataFrame aps{};
  ZigbeeApsAcknowledgementFrame ack{};
  if (ZigbeeCodec::parseApsAcknowledgementFrame(nwk.payload, nwk.payloadLength,
                                                &ack) &&
      ack.valid) {
    uint8_t ackSlot = 0U;
    if (findPendingApsAckSlot(ack, nwk.sourceShort, &ackSlot)) {
      Serial.print("aps_ack rx ctr=0x");
      Serial.print(ack.counter, HEX);
      Serial.print(" cluster=0x");
      Serial.print(ack.clusterId, HEX);
      Serial.print("\r\n");
      clearPendingApsAckSlot(ackSlot);
    }
    return;
  }
  if (!ZigbeeCodec::parseApsDataFrame(nwk.payload, nwk.payloadLength, &aps) ||
      !aps.valid) {
    (void)handleApsCommand(nwk.payload, nwk.payloadLength, nwk.sourceShort,
                           security.valid ? security.sourceIeee : 0U,
                           security.valid);
    return;
  }

  const bool duplicateAps =
      isRecentInboundApsDuplicate(nwk.sourceShort, aps, nowMs);

