lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Lights/ZigbeeHaOnOffPorchLight/ZigbeeHaOnOffPorchLight.ino
  if (aps.profileId == kZigbeeProfileZdo) {
    if (aps.deliveryMode == kZigbeeApsDeliveryUnicast && aps.ackRequested) {
      delayMicroseconds(kParentRxTurnaroundDelayUs);
      const bool ackSent = sendApsAcknowledgement(nwk.sourceShort, aps);
      Serial.print("zdo_aps_ack cluster=0x");
      Serial.print(aps.clusterId, HEX);
      Serial.print(" sent=");
      Serial.print(ackSent ? "yes" : "no");
      Serial.print("\r\n");
    }
    if (duplicateAps) {
      Serial.print("aps_dup cluster=0x");
      Serial.print(aps.clusterId, HEX);
      Serial.print(" src=0x");
      Serial.print(nwk.sourceShort, HEX);
      Serial.print("\r\n");
      return;
    }
    rememberRecentInboundAps(nwk.sourceShort, aps);
    uint16_t responseClusterId = 0U;
    uint8_t responsePayload[127] = {0U};
    uint8_t responseLength = 0U;
    const bool built =
        g_device.handleZdoRequest(aps.clusterId, aps.payload, aps.payloadLength,
                                  &responseClusterId, responsePayload,
                                  &responseLength);
    Serial.print("zdo_req cluster=0x");
    Serial.print(aps.clusterId, HEX);
    Serial.print(" built=");
    Serial.print(built ? "yes" : "no");
    Serial.print(" resp=0x");
    Serial.print(responseClusterId, HEX);
    Serial.print(" len=");
    Serial.print(responseLength);
    Serial.print("\r\n");
    if (built && responseLength > 0U) {
      const bool sent = sendApsFrame(nwk.sourceShort, 0U, responseClusterId,
                                     kZigbeeProfileZdo, 0U, responsePayload,
                                     responseLength);
      Serial.print("zdo_rsp cluster=0x");
      Serial.print(responseClusterId, HEX);
      Serial.print(" sent=");
      Serial.print(sent ? "yes" : "no");
      Serial.print("\r\n");
      uint8_t leaveFlags = 0U;
      if (g_device.consumeLeaveRequest(&leaveFlags)) {
        handleAcceptedLeaveRequest(leaveFlags);
      }
    }
    return;
  }

  const bool targetsLocalEndpoint =
      (aps.deliveryMode == kZigbeeApsDeliveryUnicast &&
       aps.destinationEndpoint == kLocalEndpoint) ||
      (aps.deliveryMode == kZigbeeApsDeliveryGroup &&
       g_device.isInGroup(aps.destinationGroup));
  if (aps.profileId != kZigbeeProfileHomeAutomation || !targetsLocalEndpoint) {
    return;
  }
  if (aps.deliveryMode == kZigbeeApsDeliveryUnicast && aps.ackRequested) {
    delayMicroseconds(kParentRxTurnaroundDelayUs);
    (void)sendApsAcknowledgement(nwk.sourceShort, aps);
  }
  if (duplicateAps) {
    Serial.print("aps_dup cluster=0x");
    Serial.print(aps.clusterId, HEX);
    Serial.print(" src=0x");
    Serial.print(nwk.sourceShort, HEX);
    Serial.print("\r\n");
    return;
  }
  rememberRecentInboundAps(nwk.sourceShort, aps);

  uint8_t responseFrame[127] = {0U};
  uint8_t responseLength = 0U;
  if (!g_device.handleZclRequest(aps.clusterId, aps.payload, aps.payloadLength,
                                 responseFrame, &responseLength)) {
    return;
  }

  const bool onOffChanged = (g_savedOnOffState != g_device.onOff());
  bool responseSent = false;
  if (responseLength > 0U &&
      aps.deliveryMode == kZigbeeApsDeliveryUnicast) {
    delayMicroseconds(kParentRxTurnaroundDelayUs);
    responseSent =
        sendApsFrame(nwk.sourceShort, aps.sourceEndpoint, aps.clusterId,
                     aps.profileId, aps.destinationEndpoint, responseFrame,
                     responseLength);
  }

  if (onOffChanged) {
    g_savedOnOffState = g_device.onOff();
    applyLedState();
    persistState();
  }

  Serial.print("zcl cluster=0x");
  Serial.print(aps.clusterId, HEX);
  Serial.print(" onoff=");
  Serial.print(g_device.onOff() ? "ON" : "OFF");
  Serial.print("\r\n");
  if (responseLength > 0U && aps.deliveryMode == kZigbeeApsDeliveryUnicast) {
    Serial.print("zcl_rsp cluster=0x");
    Serial.print(aps.clusterId, HEX);
    Serial.print(" len=");
    Serial.print(responseLength);
    Serial.print(" sent=");
    Serial.print(responseSent ? "yes" : "no");
    Serial.print("\r\n");
  }
}

void pollCoordinator() {
  refreshCommissioningState();
  if (!ZigbeeCommissioning::shouldPollParent(g_network)) {
    return;
  }

  uint8_t request[127] = {0U};
  uint8_t requestLength = 0U;
  uint16_t pollTargetShort = g_parentShort;
  if (!g_haveActiveNetworkKey &&
      (g_network.state == ZigbeeCommissioningState::kWaitingTransportKey ||
       g_network.state == ZigbeeCommissioningState::kWaitingUpdateDevice) &&
      g_network.coordinatorShort != g_parentShort) {
    g_transportCoordinatorPollToggle = !g_transportCoordinatorPollToggle;
    if (g_transportCoordinatorPollToggle) {
      pollTargetShort = g_network.coordinatorShort;
    }
  } else {
    g_transportCoordinatorPollToggle = false;
  }
  const bool useShortSource =
      ZigbeeCommissioning::selectShortSourceParentPoll(&g_network);
  const bool built =
      useShortSource
          ? ZigbeeCodec::buildDataRequestShort(g_macSequence++, g_panId,
                                              pollTargetShort, g_localShort,
                                              request, &requestLength)
          : ZigbeeCodec::buildDataRequest(g_macSequence++, g_panId,
                                          pollTargetShort, kIeeeAddress,
                                          request, &requestLength);
  if (!built) {
    return;
  }
  ZigbeeFrame frame{};
  if (g_radio.transmitThenReceive(request, requestLength, &frame, 12000U, false,
                                  1200000UL)) {
    processIncomingFrame(frame);
  }

  const uint32_t followupListenUs =
      (!g_haveActiveNetworkKey &&
       (g_network.state == ZigbeeCommissioningState::kWaitingTransportKey ||
        g_network.state == ZigbeeCommissioningState::kWaitingUpdateDevice))
          ? static_cast<uint32_t>(
                NRF54L15_CLEAN_ZIGBEE_TRANSPORT_POLL_FOLLOWUP_LISTEN_US)
          : static_cast<uint32_t>(
                NRF54L15_CLEAN_ZIGBEE_PARENT_POLL_FOLLOWUP_LISTEN_US);
  const uint32_t followupWindowStartUs = micros();
  while (static_cast<uint32_t>(micros() - followupWindowStartUs) <
         followupListenUs) {
    const uint32_t elapsedUs =
        static_cast<uint32_t>(micros() - followupWindowStartUs);
    const uint32_t remainingUs =
        (elapsedUs < followupListenUs) ? (followupListenUs - elapsedUs) : 0U;
    if (remainingUs == 0U) {
      break;
    }
    if (!g_radio.receive(&frame, remainingUs, 350000UL)) {
      continue;
    }
    processIncomingFrame(frame);
  }
}

void maybeSendScheduledReports(uint32_t nowMs) {
  if (!g_joined) {
    return;
  }

  while (sendDueAttributeReport(nowMs, nullptr)) {
  }
}

